onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_КатегорииЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_КатегорииЗаписи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОграничиватьСписокСпециализаций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Специализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Режим</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_омни_РежимОграниченияКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Режим</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_омни_РежимОграниченияКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_КатегорииЗаписи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаВыбораПодбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Элемент = Элементы.Услуги Тогда
		ИмяТЧ = "Услуги";
		ИмяПоля = "Услуга";
	ИначеЕсли Элемент = Элементы.Сотрудники Тогда
		ИмяТЧ = "Сотрудники";
		ИмяПоля = "Сотрудник";
	ИначеЕсли Элемент = Элементы.Специализации Тогда
		ИмяТЧ = "Специализации";
		ИмяПоля = "Специализация";
	Иначе
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяПоля, ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() Тогда
			Возврат;
		КонецЕсли;  
		
		НоваяСтрока = Объект[ИмяТЧ].Добавить();
		НоваяСтрока[ИмяПоля] = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Отбор = Новый Структура("ПометкаУдаления, бит_омни_НеВыгружать", Ложь, Ложь);
	Если Команда.Имя = "ПодборНоменклатуры" Тогда
		ИмяСправочника = "Номенклатура";
		ТекущийЭлемент = Элементы.Услуги;
		Отбор.Вставить("ВидНоменклатура", ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга"));
	ИначеЕсли Команда.Имя = "ПодборСотрудников" Тогда
		ИмяСправочника = "Сотрудники";
		ТекущийЭлемент = Элементы.Сотрудники;
	ИначеЕсли Команда.Имя = "ПодборСпециализации" Тогда
        ИмяСправочника = "КатегорииВыработки";
		ТекущийЭлемент = Элементы.Специализации;
	Иначе
		Возврат;
	КонецЕсли;                      
	
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриВыборе, РежимВыбора", Отбор, Ложь, Истина);
	
	ИмяФормыСправочника = СтрШаблон("Справочник.%1.ФормаВыбора", ИмяСправочника);
	ОткрытьФорму(ИмяФормыСправочника, ПараметрыФормы, ТекущийЭлемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
